<template lang="html">
  <v-container>
    <v-card flat >
      <v-card-text>
        <h2 class="text-center" style="color: #0165ba; margin-top:35px;">นโยบายการคุ้มครองข้อมูลส่วนบุคคลของ  มหาวิทยาลัยสงขลานครินทร์</h2>
        <p class="text-center">Privacy Policy of PSU</p>
        <v-divider></v-divider><br><br>
        <p>&nbsp;&nbsp;&nbsp;&nbsp; มหาวิทยาลัยสงขลานครินทร์ ได้จัดทำนโยบายการคุ้มครองข้อมูลส่วนบุคคลฉบับนี้ขึ้น เพื่อคุ้มครองข้อมูลส่วนบุคคล
          ของผู้ใช้บริการทุกท่าน (Personal Information) ที่ติดต่อเข้ามายังเว็บไซต์ของ มหาวิทยาลัยสงขลานครินทร์ ดังนี้</p>
        <b>การเก็บรวบรวมข้อมูลส่วนบุคคล</b><br /><br>
        <ol>
          <li>
              เพื่อความสะดวกในการให้บริการแก่ผู้ใช้บริการทุกท่านที่เข้ามาใช้บริการเว็บไซต์ของ มหาวิทยาลัยสงขลานครินทร์ทางเว็บไซต์จึงได้จัดเก็บรวบรวมข้อมูลส่วนบุคคลของท่านไว้ เช่น อีเมลแอดเดรส (Email Address) ชื่อ
              (Name) ที่อยู่หรือที่ทำงาน (Home or Work Address) เขตไปรษณีย์ (ZIP Code) หรือหมายเลขโทรศัพท์ (Telephone Number) เป็นต้น
          </li>
          <li>
              ในกรณีที่ท่านสมัคร (Sign Up) เพื่อสมัครสมาชิกหรือเพื่อใช้บริการอย่างใดอย่างหนึ่ง  มหาวิทยาลัยสงขลานครินทร์จะเก็บรวบรวมข้อมูลส่วนบุคคลของท่านเพิ่มเติม ได้แก่ เพศ (Sex) อายุ (Gender) สิ่งที่โปรดปราน/
              ความชอบ (Preferences/Favorites) ความสนใจ (Interests) หรือหมายเลขบัตรเครดิต (Credit Card Number) และที่อยู่ในการแจ้งค่าใช้จ่าย (Billing Address)
          </li>
          <li>
              นอกจากนั้น เพื่อสำรวจความนิยมในการใช้บริการ อันจะเป็นประโยชน์ในการนำสถิติไปใช้ในการปรับปรุง
              คุณภาพในการให้บริการของ มหาวิทยาลัยสงขลานครินทร์ จึงจำเป็นต้องจัดเก็บรวบรวมข้อมูลของท่านบางอย่าง
              เพิ่มเติม ได้แก่ หมายเลขไอพี (IP Address) ชนิดของโปรแกรม ค้นผ่าน (Browser Type) โดเมนเนม
              (Domain Name) บันทึกหน้าเว็บ (web page) ของเว็บไซต์ที่ผู้ใช้เยี่ยมชม เวลาที่เยี่ยมชมเว็บไซต์
              (Access Times) และเว็บไซต์ที่ผู้ใช้บริการเข้าถึงก่อนหน้านั้น (Referring Website Addresses)
          </li>
          <li>
             มหาวิทยาลัยสงขลานครินทร์ ขอแนะนำให้ท่านตรวจสอบนโยบายการคุ้มครองข้อมูลส่วนบุคคล (PrivacyPolicy)
              ของเว็บไซต์อื่นที่เชื่อมโยงจากเว็บไซต์นี้ เพื่อจะได้ทราบและเข้าใจว่าเว็บไซต์ดังกล่าวเก็บรวบรวม ใช้ หรือ
              ดำเนินการเกี่ยวกับข้อมูลส่วนบุคคลของท่านอย่างไร ทั้งนี้  มหาวิทยาลัยสงขลานครินทร์ไม่สามารถรับรอง ข้อความ
              หรือรับรองการดำเนินการใดๆ ตามที่ได้มีการประกาศไว้ในเว็บไซต์ดังกล่าวได้ และไม่ขอรับผิดชอบใดๆ
              หากเว็บไซต์เหล่านั้นไม่ได้ปฏิบัติการหรือดำเนินการใดๆ ตามนโยบายการคุ้มครองข้อมูลส่วนบุคคลที่
              เว็บไซต์ดังกล่าวได้ประกาศไว้
          </li>
        </ol><br>
        <b>การใช้ข้อมูลส่วนบุคคล</b>
        <ol><br />
          <li>
             มหาวิทยาลัยสงขลานครินทร์ จะใช้ข้อมูลส่วนบุคคลของท่านเพียงเท่าที่จำเป็น เช่น ชื่อ และ ที่อยู่ เพื่อใช้ในการ
              ติดต่อ ให้บริการประชาสัมพันธ์ หรือให้ข้อมูลข่าวสารต่างๆ รวมทั้งสำรวจความคิดเห็นของท่านใน
              กิจการหรือกิจกรรมของ  มหาวิทยาลัยสงขลานครินทร์ เท่านั้น
          </li>
          <li>
             มหาวิทยาลัยสงขลานครินทร์ ขอรับรองว่าจะไม่นำข้อมูลส่วนบุคคลของท่านที่  มหาวิทยาลัยสงขลานครินทร์ ได้เก็บรวบรวมไว้ ไปขายหรือเผยแพร่ให้กับบุคคลภายนอกโดยเด็ดขาด เว้นแต่จะได้รับอนุญาตจากท่านเท่านั้น
          </li>
          <li>
                            ในกรณีที่  มหาวิทยาลัยสงขลานครินทร์ ได้ว่าจ้างหน่วยงานอื่นเพื่อให้ดำเนินการเกี่ยวกับข้อมูลส่วนบุคคลของ
                ท่าน เช่น การจัดส่งพัสดุไปรษณีย์ การวิเคราะห์เชิงสถิติในกิจการหรือกิจกรรมของ  มหาวิทยาลัยสงขลานครินทร์
                เป็นต้น  มหาวิทยาลัยสงขลานครินทร์ จะกำหนดให้หน่วยงานที่ได้ว่าจ้างให้ดำเนินการดังกล่าว เก็บรักษาความลับ
                และความปลอดภัยของข้อมูลส่วนบุคคลของท่าน และกำหนดข้อห้ามมิให้มีการนำข้อมูลส่วนบุคคล
                ดังกล่าว ไปใช้นอกเหนือจากกิจกรรมหรือกิจการของ  มหาวิทยาลัยสงขลานครินทร์
          </li>
        </ol><br>
        <b>สิทธิในการควบคุมข้อมูลส่วนบุคคลของท่าน</b><br>
        <p><br>
          &nbsp;&nbsp;&nbsp;&nbsp;เพื่อประโยชน์ในการรักษาความเป็นส่วนตัวของท่านๆ มีสิทธิเลือกที่จะให้มีการใช้หรือแชร์ข้อมูลส่วน
          บุคคลของท่าน หรืออาจเลือกที่จะไม่รับข้อมูลหรือสื่อทางการตลาดใดๆ จาก  มหาวิทยาลัยสงขลานครินทร์ ก็ได้ โดยเพียงแต่
          ท่านกรอกความจำนงดังกล่าวเพื่อแจ้งให้  มหาวิทยาลัยสงขลานครินทร์ ทราบในหน้าเว็บ https://www.psu.ac.th/
        </p>
        <b>การรักษาความปลอดภัยสำหรับข้อมูลส่วนบุคคล</b>
        <p><br>
          &nbsp;&nbsp;&nbsp;&nbsp;เพื่อประโยชน์ในการรักษาความลับและความปลอดภัยสำหรับข้อมูลส่วนบุคคลของท่าน  มหาวิทยาลัยสงขลานครินทร์
          จึงได้กำหนดระเบียบภายในหน่วยงานเพื่อกำหนดสิทธิในการเข้าถึงหรือใช้ข้อมูลส่วนบุคคลของท่าน และเพื่อรักษา
          ความลับและความปลอดภัยของข้อมูลบางอย่างที่มีความสำคัญอย่างยิ่ง เช่น หมายเลขบัตรเครดิต เป็นต้น
           มหาวิทยาลัยสงขลานครินทร์ จึงได้จัดให้มีช่องทางการสื่อสารแบบปลอดภัยสำหรับข้อมูลดังกล่าวด้วยการเข้ารหัสลับข้อมูล
          ดังกล่าว เช่น จัดให้มีการใช้ Secure Socket Layer (SSL) protocol เป็นต้น
        </p>
        <b>การใช้คุกกี้ (Cookies)</b>
        <p><br>
              &nbsp;&nbsp;&nbsp;&nbsp;“คุกกี้” คือ ข้อมูลที่  มหาวิทยาลัยสงขลานครินทร์ ส่งไปยังโปรแกรมค้นผ่านเว็บไซต์ (Web browser) ของผู้ใช้บริการ
            และเมื่อมีการติดตั้งข้อมูลดังกล่าวไว้ในระบบของท่านแล้ว หากมีการใช้ “คุกกี้” ก็จะทำให้เว็บไซต์
            https://www.psu.ac.th/ สามารถบันทึกหรือจดจำข้อมูลของผู้ใช้บริการไว้ จนกว่าผู้ใช้บริการจะออกจาก
            โปรแกรมค้นผ่านเว็บไซต์ หรือจนกว่าผู้ใช้บริการจะทำการลบ “คุกกี้” นั้นเสีย หรือไม่อนุญาตให้ “คุกกี้” นั้น
            ทำงานอีกต่อไป
        </p>
        <p>
            &nbsp;&nbsp;&nbsp;&nbsp;หากท่านเลือกใช้ “คุกกี้” แล้ว ท่านจะได้รับความสะดวกสบายในการท่องเว็บไซต์มากขึ้น เพราะ “คุกกี้”
          จะช่วยจดจำเว็บไซต์ที่ท่านแวะหรือเยี่ยมชม ทั้งนี้  มหาวิทยาลัยสงขลานครินทร์ จะนำข้อมูลที่ “คุกกี้” ได้บันทึกหรือเก็บ
          รวบรวมไว้ ไปใช้ในการวิเคราะห์เชิงสถิติ หรือในกิจกรรมอื่นของ  มหาวิทยาลัยสงขลานครินทร์ เพื่อ ปรับปรุงคุณภาพการ
          ให้บริการของ  มหาวิทยาลัยสงขลานครินทร์ ต่อไป
        </p>
        <b>การปรับปรุงนโยบายการคุ้มครองข้อมูลส่วนบุคคล</b>
        <p><br>
            &nbsp;&nbsp;&nbsp;&nbsp; มหาวิทยาลัยสงขลานครินทร์ อาจทำการปรับปรุงหรือแก้ไขนโยบายการคุ้มครองข้อมูลส่วนบุคคลโดยมิได้แจ้งให้ท่าน
          ทราบล่วงหน้า ทั้งนี้ เพื่อความเหมาะสมและมีประสิทธิภาพในการให้บริการ ดังนั้น  มหาวิทยาลัยสงขลานครินทร์ จึงขอ
          แนะนำให้ผู้ใช้บริการอ่านนโยบายการคุ้มครองข้อมูลส่วนบุคคลทุกครั้งที่เยี่ยมชม หรือมีการใช้บริการจากเว็บไซต์
          ของ มหาวิทยาลัยสงขลานครินทร์
        </p>
        <b>การปฏิบัติตามนโยบายคุ้มครองข้อมูลส่วนบุคคลและการติดต่อกับ  มหาวิทยาลัยสงขลานครินทร์</b>
        <p><br>
            &nbsp;&nbsp;&nbsp;&nbsp;ในกรณีที่ท่านมีข้อสงสัย ข้อเสนอแนะ หรือข้อติชมใดๆ เกี่ยวกับนโยบายการคุ้มครองข้อมูลส่วนบุคคล
          หรือการปฏิบัติตามนโยบายการคุ้มครองข้อมูลส่วนบุคคลฉบับนี้  มหาวิทยาลัยสงขลานครินทร์ ยินดีที่จะตอบข้อสงสัย รับฟัง
          ข้อเสนอแนะ และคำติชมทั้งหลาย อันจะเป็นประโยชน์ต่อการปรับปรุงการให้บริการของ มหาวิทยาลัยสงขลานครินทร์ ต่อไป
          โดยท่านสามารถติดต่อกับ  มหาวิทยาลัยสงขลานครินทร์ ตามที่อยู่ที่ปรากฏข้างล่างนี้
        </p>
        <p>
           มหาวิทยาลัยสงขลานครินทร์<br>
          15 ถ.กาญจนวณิชย์ อ.หาดใหญ่ จ.สงขลา 90110 <br>
          โทรศัพท์ 0-7428-2000 <br>
          โทรสาร 0-7455-8941 <br>
          Email - saraban@psu.ac.th <br>
        </p>
        <br><br />  <br><br />
        <p style="text-align: right;"> นโยบายการคุ้มครองข้อมูลส่วนบุคคลของ  มหาวิทยาลัยสงขลานครินทร์<br>
            Privacy Policy of PSU <br>
            จัดทำเมื่อวันที่ 1 มกราคม 2567
      </p>
      </v-card-text>
    </v-card>
  </v-container>
</template>

<script>
export default {
}
</script>

<style lang="css" scoped>
.text-center {
  text-align: center;
}

</style>
